# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

# Решение:

a = [32, 2.22, 'строка']

print(type(a))     # проверяем тип данных всего списка
print(type(a[0]))  # проверяем тип данных каждого элемента
print(type(a[1]))  # проверяем тип данных каждого элемента
print(type(a[2]))  # проверяем тип данных каждого элемента








